#+BEGIN_COMMENT
.. title: A First Look at dplyr
.. slug: a-first-look-at-dplyr
.. date: 2021-12-16 16:59:04 UTC-08:00
.. tags: r,data transformation,dplyr
.. category: Data Tranformation
.. link: 
.. description: A look at the R package dplyr.
.. type: text

#+END_COMMENT
#+OPTIONS: ^:{}
#+TOC: headlines 3
#+PROPERTY: header-args :session dplyr-post
* The Data
  We're going to look at the ~flights~ dataframe loaded by the [[https://www.rdocumentation.org/packages/nycflights13/versions/1.0.1][~nycflights13~]] package (which, curiously, R loads using the ~library~ function).

#+begin_src R :results output :exports both
str(flights)
#+end_src

#+RESULTS:
#+begin_example
tibble [336,776 × 19] (S3: tbl_df/tbl/data.frame)
 $ year          : int [1:336776] 2013 2013 2013 2013 2013 2013 2013 2013 2013 2013 ...
 $ month         : int [1:336776] 1 1 1 1 1 1 1 1 1 1 ...
 $ day           : int [1:336776] 1 1 1 1 1 1 1 1 1 1 ...
 $ dep_time      : int [1:336776] 517 533 542 544 554 554 555 557 557 558 ...
 $ sched_dep_time: int [1:336776] 515 529 540 545 600 558 600 600 600 600 ...
 $ dep_delay     : num [1:336776] 2 4 2 -1 -6 -4 -5 -3 -3 -2 ...
 $ arr_time      : int [1:336776] 830 850 923 1004 812 740 913 709 838 753 ...
 $ sched_arr_time: int [1:336776] 819 830 850 1022 837 728 854 723 846 745 ...
 $ arr_delay     : num [1:336776] 11 20 33 -18 -25 12 19 -14 -8 8 ...
 $ carrier       : chr [1:336776] "UA" "UA" "AA" "B6" ...
 $ flight        : int [1:336776] 1545 1714 1141 725 461 1696 507 5708 79 301 ...
 $ tailnum       : chr [1:336776] "N14228" "N24211" "N619AA" "N804JB" ...
 $ origin        : chr [1:336776] "EWR" "LGA" "JFK" "JFK" ...
 $ dest          : chr [1:336776] "IAH" "IAH" "MIA" "BQN" ...
 $ air_time      : num [1:336776] 227 227 160 183 116 150 158 53 140 138 ...
 $ distance      : num [1:336776] 1400 1416 1089 1576 762 ...
 $ hour          : num [1:336776] 5 5 5 5 6 5 6 6 6 6 ...
 $ minute        : num [1:336776] 15 29 40 45 0 58 0 0 0 0 ...
 $ time_hour     : POSIXct[1:336776], format: "2013-01-01 05:00:00" "2013-01-01 05:00:00" ...
#+end_example

The dataset lists all the flights that left New York City airports in 2013 heading to destinations in the United States, Puerto Rico, and the American Virgin Islands.

* Summarize
  ~summarize~ reduces a collection of numbers to a single summary statistic. As an example we can look at the median departure delay. First, let's check if it has any missing values.

#+begin_src R :results output :exports both
see_if(noNA(flights$dep_delay))
#+end_src

#+RESULTS:
: [1] FALSE
: attr(,"msg")
: [1] "flights$dep_delay contains 8255 missing values"

Okay, so we'll just tell ~median~ to ignore it.

#+begin_src R :results output raw :exports both
okable(summarize(flights, median_departure_delay=median(dep_delay, na.rm=TRUE)))
#+end_src

#+RESULTS:


| median_departure_delay|
|-----------------------|
|                     -2|


#+begin_src R :results output :exports both
median(flights$dep_delay, na.rm=TRUE)
#+end_src

#+RESULTS:
: [1] -2

So, you might think, well, all we did was add a columns name, was that useful?

